# Завдання 1
# Створіть масив:
# [1, 2, 3, 4]
# [5, 6, 7, 8]
# [9, 10, 11, 12]
# [13, 14, 15, 16]
import numpy as np

# array = np.array([[1, 2, 3, 4],
#                   [5, 6, 7, 8],
#                   [9, 10, 11, 12],
#                   [13, 14, 15, 16]])
# # Використовуючи індекси виведіть:
# print(array)
#
# # число 14
# print(array[-1,1]) # число 14
#
# # третій рядок
# print(array[2]) # рядок [9, 10, 11, 12]
#
# # перший стовпчик
# print(array[:, 0]) # стовпчик [1, 5, 9, 13]
#
# # верхню половину
# print(array[:2, :]) # верхня половина [1, 2, 3, 4], [5, 6, 7, 8]
#
# # замініть числа в рядках 2-3 на 100
# array[1:3, :] = 100
# print(array)
#
# # зробіть другий рядок таким як останній рядок
# array[1:2, :] = array[-1, :]
# print(array)

# Завдання 2
# У масиві з попереднього завдання створіть маску для
# парних чисел. З її допомогою

# # виведіть самі числа
# mask = array % 2 == 0
# print(mask)
# even_array = array[mask]
# print(even_array)
#
# # замініть їх на 100
# array[mask] = 100
# print(array)

# Завдання 3
# Створіть 2 масиви типу uint8:
# Масив 1: 128 200 10
# Масив 2: 250 10 34
# Об’єднайте їх у пропорції 20% першого масив + 80%
# другого масиву. В результаті має бути тип даних uint8 та
# числа в діапазоні 0-255

# array1 = np.array([128, 200, 10], dtype=np.uint8)
# array2 = np.array([250, 10, 34], dtype=np.uint8)
#
# result = (array1 * 0.2 + array2 * 0.8).astype(np.uint8)
# print(result)